20260310T215605--kdoc-553-dateはわずかな違いでタイムゾーンが変わる__permanent.org
:properties:
:ID: 20260310T215605
:end:
#+title:      KDOC 553: Dateはわずかな違いでタイムゾーンが変わる
#+date:       [2026-03-10 Tue 21:56]
#+filetags:   :permanent:
#+identifier: 20260310T215605

* この文書のステータス
- 作成
  - [X] 2026-03-15 貴島
- レビュー
  - [X] 2026-04-19 貴島

* 概要

JavaScriptで、 ~Date~ オブジェクトのタイムゾーンがコンストラクタの日時フォーマットによって変わるのにハマった。有名な落とし穴のようである。

#+caption: 表す時間が変わる。console.logでUTCに変換されている
#+begin_src js
  // どちらもタイムゾーンオフセットがない。日時の有無の違い
  console.log(new Date('2026-06-01')) // UTC -> UTC
  console.log(new Date('2026-06-01T00:00:00')) // local timezone(Asia/Tokyo) -> UTC
#+end_src

#+RESULTS:
#+begin_src
2026-06-01T00:00:00.000Z
2026-05-31T15:00:00.000Z
undefined
#+end_src

仕様を見る。

#+begin_quote
タイムゾーンオフセットがない場合、日付のみの形式は UTC 時刻として解釈され、日時形式はローカル時刻として解釈されます。
[[https://developer.mozilla.org/ja/docs/Web/JavaScript/Reference/Global_Objects/Date][Date - JavaScript | MDN]]
#+end_quote

* 関連

- 類推: Dateオブジェクトまわりで、同じようなわかりにくい仕様はあるだろうか
