20260310T215605--kdoc-553-dateはわずかな違いでタイムゾーンが変わる__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-05-23T22:38:05Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 553: Dateはわずかな違いでタイムゾーンが変わる</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 553: Dateはわずかな違いでタイムゾーンが変わる</h1>
<div id="outline-container-org4cf4ebe" class="outline-2">
<h2 id="org4cf4ebe"><a href="#org4cf4ebe">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org4cf4ebe">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-03-15 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-04-19 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8a944e2" class="outline-2">
<h2 id="org8a944e2"><a href="#org8a944e2">概要</a></h2>
<div class="outline-text-2" id="text-org8a944e2">
<p>
JavaScriptで、 <code>Date</code> オブジェクトのタイムゾーンがコンストラクタの日時フォーマットによって変わるのにハマった。有名な落とし穴のようである。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>表す時間が変わる。console.logでUTCに変換されている</label><pre class="src src-js"><span class="org-comment-delimiter">// </span><span class="org-comment">&#12393;&#12385;&#12425;&#12418;&#12479;&#12452;&#12512;&#12478;&#12540;&#12531;&#12458;&#12501;&#12475;&#12483;&#12488;&#12364;&#12394;&#12356;&#12290;&#26085;&#26178;&#12398;&#26377;&#28961;&#12398;&#36949;&#12356;
</span>console.log(<span class="org-keyword">new</span> <span class="org-type">Date</span>(<span class="org-string">'2026-06-01'</span>)) <span class="org-comment-delimiter">// </span><span class="org-comment">UTC -&gt; UTC
</span>console.log(<span class="org-keyword">new</span> <span class="org-type">Date</span>(<span class="org-string">'2026-06-01T00:00:00'</span>)) <span class="org-comment-delimiter">// </span><span class="org-comment">local timezone(Asia/Tokyo) -&gt; UTC</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">2026-06-01T00:00:00.000Z
2026-05-31T15:00:00.000Z
undefined
</pre>
</div>

<p>
仕様を見る。
</p>

<blockquote>
<p>
タイムゾーンオフセットがない場合、日付のみの形式は UTC 時刻として解釈され、日時形式はローカル時刻として解釈されます。
<a href="https://developer.mozilla.org/ja/docs/Web/JavaScript/Reference/Global_Objects/Date">Date - JavaScript | MDN</a>
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org94242d3" class="outline-2">
<h2 id="org94242d3"><a href="#org94242d3">関連</a></h2>
<div class="outline-text-2" id="text-org94242d3">
<ul class="org-ul">
<li>類推: Dateオブジェクトまわりで、同じようなわかりにくい仕様はあるだろうか</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
